 #Напишите программу, в которой пользователь будет задавать две строки,
#а программа - определять количество вхождений одной строки в другой.#

test_str = input ("Введите строку ")
counter = test_str.count('t') 
print ("количество вхождений  : "
                           +  str(counter)) 