#Задайте список из N элементов, заполненных числами из промежутка [-N, N].
#Найдите произведение элементов на позициях a и b.
#Значения N, a и b вводит пользователь с клавиатуры.

#x = int (input ("введите число "))
#y = int (input ("введите число "))
n = int (input("введите число "))
a = []
b  = a

for i in range (n+1):
 a.append (-i ) in range (n+1)
for i in range (n+1):
 b.append (i) in range (n+1)
print ('b=', b)
x = int (input("введите номер первого элемента "))
y = int (input("введите номер второго элемента "))
sum = (0)
sum= (a [x]*b[y])
print (sum)
print (a[x])
print (a[y])
